course/set theory 1/homework/10/homework10.org
#+TITLE: Homework 10

#+AUTHOR: 陈淇奥@@latex:\\@@21210160025
#+OPTIONS: toc:nil
#+LATEX_HEADER: \input{../../../preamble-lite.tex}
#+LATEX_HEADER: \usepackage[UTF8]{ctex}

#+BEGIN_exercise
对任意\(\alpha\)上的滤\(F\)，如果\(X\notin F\)，则\(\alpha-X\)有正测度
#+END_exercise

#+BEGIN_proof
如果存在\(Y\in F\)使得\((\alpha-X)\cap Y=\emptyset\)，于是\(Y\subseteq X\)，因此\(X\in F\)，矛盾
#+END_proof

#+BEGIN_exercise
令\(\kappa\)为不可数正则基数，\(U\)为\(\kappa\)上\(\kappa\)完全的正则非主超滤，则\(\kappa\)的所有无界闭集都属于\(U\)
#+END_exercise

#+BEGIN_proof
因为\(\kappa\)不是主超滤，对于任意\(\alpha\in\kappa\),\(\kappa\setminus\{\alpha\}\in U\)，

如果存在\(\alpha_0\)使得\(\{\alpha:\alpha_0\}\in U\)，于是任意

对于任意无界闭集\(C\)，存在一个严格递增连续函数\(f:\kappa\to\kappa\)使得\(f(\kappa)=C\)，令\(X_\alpha=\{\xi:f(\alpha)<\xi<\kappa\}\)
#+END_proof

#+BEGIN_exercise
对任意不可数正则基数\(\kappa\)，任意连续共尾函数\(f:\kappa\to\kappa\)，它的不动点集\(\{\epsilon\mid f(\epsilon)=\epsilon\}\)是\(\kappa\)的无界闭集
#+END_exercise

#+BEGIN_proof
令\(S=\{\epsilon\mid f(\epsilon)=\epsilon\}\)

无界：对任意\(\alpha\in\kappa\)，令\(\epsilon_0=f(\alpha)\),\(\epsilon_{n+1}=f(\epsilon_n)\),\(\epsilon=\bigcup_{n\in\omega}\epsilon_n\)。于是\(\epsilon\)是不动点且\(\epsilon>\alpha\)

闭：对任意\(\eta\)使得\(\sup(S\cap\eta)=\eta\)，于是\(f(\eta)=\bigcup\{f(\beta):\beta\in S\cap\eta\}=\bigcup\{\beta:\beta\in S\cap\eta\}=\eta\)，因此\(\eta\in S\)
#+END_proof

#+BEGIN_exercise
\(\kappa\)是马洛基数当且仅当集合\(S=\{\lambda<\kappa\mid\lambda\text{是不可达基数}\}\)是\(\kappa\)上的平稳集
#+END_exercise

#+BEGIN_proof
\(\Rightarrow\)。对任意无界闭集\(C\)，都存在一个严格递增且连续的函数\(f:\kappa\to\kappa\)使得\(C=\im(f)\)。于是\(f\)有一个不动点\(\epsilon\)且\(\epsilon\)是不可达基数，因此\(C\cap S\neq\emptyset\)

\(\Leftarrow\)。对于任意\(\kappa\)上的连续共尾函数\(f:\kappa\to\kappa\)，它的不动点集\(A=\{\epsilon\mid f(\epsilon)=\epsilon\}\)是无界闭集，因此存
在\(\lambda\in A\cap S\)

#+END_proof

#+BEGIN_exercise
令\(T\subseteq\N^{<\omega}\)，满足对任意\(s\in T\)，任意\(n\in\dom(s)\),\(s(n+1)<s(n)\)。\((T,\subset)\)是一棵树，证
明\(T\)没有无穷枝
#+END_exercise

#+BEGIN_proof
若\(T\)有无穷枝\((s_i:i\in\omega)\)，令\(s=\bigcup_{i\in\omega} s_i\)，于是\(\dom(s)=\omega\)，而对于任意\(n\in\omega\)，
\(s(n+1)<s(n)\)，于是得到一条无穷下降链，矛盾
#+END_proof

#+BEGIN_exercise
3.4.9中\(F\)是\(\aleph_1\)完全的非主超滤
#+END_exercise

#+BEGIN_proof
\(X_0=\emptyset\)，因为\(U\)是超滤，\(\emptyset\in F\)。

\(X_\gamma=\bigcup_{\beta\in\gamma}X_\gamma\in U\)，因此\(\gamma\in F\)。

若\(M\subseteq N\)且\(M\in F\)，于是\(X_M\subseteq X_N\)，而\(X_M\in U\)，于是\(X_N\in U\)，\(N\in F\)。

若\(M,N\in F\)，\(X_{M\cap N}=X_M\cap X_N\in U\)，于是\(M\cap N\in F\)。

对任意\(M\subseteq\gamma\),\(X_M\in U\)或\(X_M^c\in U\)，而\(X_M^c=X_{\gamma\setminus M}\)，因此\(M\in F\)或\(\gamma\setminus M\in F\)。于是\(F\)是超
滤。

由于每个\(X_\beta\notin U\)，所以\(\{\beta\}\notin F\)，\(F\)是非主超滤。

对于任意\(\{Y_i:i\in\omega\}\)，因为\(U\)是\(\aleph_1\)完全的滤，\(\bigcap_{i\in\omega}X_{Y_i}\in U\)，于是\(\bigcap_{i\in\omega}Y_i\in U\)。
#+END_proof
